In [2]:
import pandas as pd
import numpy as np

In [67]:
path_data = '/Users/xavierpivan/Projets/training/data/'

# Attribute access

The attribute refers to the columns name

In [31]:
np.random.seed(42)
A = np.random.randint(0,5,(5,7))

In [33]:
A

array([[3, 4, 2, 4, 4, 1, 2],
       [2, 2, 4, 3, 2, 4, 1],
       [3, 1, 3, 4, 0, 3, 1],
       [4, 3, 0, 0, 2, 2, 1],
       [3, 3, 2, 3, 3, 0, 2]])

In [34]:
df = pd.DataFrame(data=A,
                 index=pd.date_range('20130101', periods=A.shape[0]))

In [35]:
df

            0  1  2  3  4  5  6
2013-01-01  3  4  2  4  4  1  2
2013-01-02  2  2  4  3  2  4  1
2013-01-03  3  1  3  4  0  3  1
2013-01-04  4  3  0  0  2  2  1
2013-01-05  3  3  2  3  3  0  2

In [36]:
df[:3]

            0  1  2  3  4  5  6
2013-01-01  3  4  2  4  4  1  2
2013-01-02  2  2  4  3  2  4  1
2013-01-03  3  1  3  4  0  3  1

In [37]:
df[::-1]

            0  1  2  3  4  5  6
2013-01-05  3  3  2  3  3  0  2
2013-01-04  4  3  0  0  2  2  1
2013-01-03  3  1  3  4  0  3  1
2013-01-02  2  2  4  3  2  4  1
2013-01-01  3  4  2  4  4  1  2

In [38]:
df.loc['2013-01-02':'2013-01-05']

            0  1  2  3  4  5  6
2013-01-02  2  2  4  3  2  4  1
2013-01-03  3  1  3  4  0  3  1
2013-01-04  4  3  0  0  2  2  1
2013-01-05  3  3  2  3  3  0  2

In [39]:
df.0

SyntaxError: invalid syntax (355225977.py, line 1)

In [41]:
df.columns = list('abcdefg')

In [42]:
df.b

2013-01-01    4
2013-01-02    2
2013-01-03    1
2013-01-04    3
2013-01-05    3
Freq: D, Name: b, dtype: int64

In [50]:
mask = pd.array([True, False, True, False, pd.NA], dtype="boolean")
mask_columns = pd.array([True, False, True, False, pd.NA, True, True], dtype="boolean")

mask

<BooleanArray>
[True, False, True, False, <NA>]
Length: 5, dtype: boolean

In [54]:
df.iloc[:, mask_columns]

            a  c  f  g
2013-01-01  3  2  1  2
2013-01-02  2  4  4  1
2013-01-03  3  3  3  1
2013-01-04  4  0  2  1
2013-01-05  3  2  0  2

In [55]:
s = pd.Series(list('abcde'), index=[0, 3, 2, 5, 4])

s.loc[3:5]

3    b
2    c
5    d
dtype: object

In [57]:
s.iloc[3:5]

5    d
4    e
dtype: object

# Selection by callable

In [58]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list('abcdef'),
                   columns=list('ABCD'))

In [59]:
df1.loc[lambda df: df['A'] > 0, :]

          A         B         C         D
a  0.417011  0.832462 -0.293399 -0.029839
b  0.095126  0.664654 -0.140218 -0.033193

In [65]:
df1.loc[lambda rp: rp['A'] > 0, :]

          A         B         C         D
a  0.417011  0.832462 -0.293399 -0.029839
b  0.095126  0.664654 -0.140218 -0.033193

In [66]:
df1[df1['A']>0]

          A         B         C         D
a  0.417011  0.832462 -0.293399 -0.029839
b  0.095126  0.664654 -0.140218 -0.033193

In [68]:
path_baseball = path_data+'baseball.csv'

In [70]:
df = pd.read_csv(path_baseball)

In [72]:
(df.groupby(['year', 'team']).sum(numeric_only=True)
   .loc[lambda df: df['r'] > 100])

                id  stint    g    ab    r    h  X2b  X3b  hr    rbi    sb
year team
2007 CIN    536621      6  379   745  101  203   35    2  36  125.0  10.0  \
     DET    446997      5  301  1062  162  283   54    4  37  144.0  24.0
     HOU    357725      4  311   926  109  218   47    6  14   77.0  10.0
     LAN    715256     11  413  1021  153  293   61    3  36  154.0   7.0
     NYN   1073198     13  622  1854  240  509  101    3  61  243.0  22.0
     SFN    447198      5  482  1305  198  337   67    6  40  171.0  26.0
     TEX    178804      2  198   729  115  200   40    4  28  115.0  21.0
     TOR    357561      4  459  1408  187  378   96    2  58  223.0   4.0

            cs   bb     so   ibb   hbp    sh    sf  gidp
year team
2007 CIN   1.0  105  127.0  14.0   1.0   1.0  15.0  18.0
     DET   7.0   97  176.0   3.0  10.0   4.0   8.0  28.0
     HOU   4.0   60  212.0   3.0   9.0  16.0   6.0  17.0
     LAN   5.0  114  141.0   8.0   9.0   3.0   8.0  29.0
     NYN   4.0  174  310.0  24.0  23.0  18.0  15.0  48.0
     SFN   7.0  235  188.0  51.0   8.0  16.0   6.0  41.0
     TEX   4.0   73  140.0   4.0   5.0   2.0   8.0  16.0
     TOR   2.0  190  265.0  16.0  12.0   4.0  16.0  38.0

In [76]:
df.groupby(['year', 'team']).sum(numeric_only=True).loc[lambda df:df['r']>100]

                id  stint    g    ab    r    h  X2b  X3b  hr    rbi    sb
year team
2007 CIN    536621      6  379   745  101  203   35    2  36  125.0  10.0  \
     DET    446997      5  301  1062  162  283   54    4  37  144.0  24.0
     HOU    357725      4  311   926  109  218   47    6  14   77.0  10.0
     LAN    715256     11  413  1021  153  293   61    3  36  154.0   7.0
     NYN   1073198     13  622  1854  240  509  101    3  61  243.0  22.0
     SFN    447198      5  482  1305  198  337   67    6  40  171.0  26.0
     TEX    178804      2  198   729  115  200   40    4  28  115.0  21.0
     TOR    357561      4  459  1408  187  378   96    2  58  223.0   4.0

            cs   bb     so   ibb   hbp    sh    sf  gidp
year team
2007 CIN   1.0  105  127.0  14.0   1.0   1.0  15.0  18.0
     DET   7.0   97  176.0   3.0  10.0   4.0   8.0  28.0
     HOU   4.0   60  212.0   3.0   9.0  16.0   6.0  17.0
     LAN   5.0  114  141.0   8.0   9.0   3.0   8.0  29.0
     NYN   4.0  174  310.0  24.0  23.0  18.0  15.0  48.0
     SFN   7.0  235  188.0  51.0   8.0  16.0   6.0  41.0
     TEX   4.0   73  140.0   4.0   5.0   2.0   8.0  16.0
     TOR   2.0  190  265.0  16.0  12.0   4.0  16.0  38.0

# Combining positional and label-based indexing

In [80]:
dfd = pd.DataFrame({'A': [1, 2, 3],
                    'B': [4, 5, 6]},
                   index=list('abc'))
dfd

   A  B
a  1  4
b  2  5
c  3  6

In [78]:
dfd.loc[dfd.index[[0, 2]], 'A']

a    1
c    3
Name: A, dtype: int64

In [79]:
dfd.iloc[[0, 2], dfd.columns.get_loc('A')]

a    1
c    3
Name: A, dtype: int64

In [81]:
dfd.index[[0, 2]]

Index(['a', 'c'], dtype='object')

In [85]:
dfd.columns.get_loc('A')

0

# Indexing with list with missing labels is deprecated

In [86]:
s = pd.Series([1, 2, 3])

In [87]:
s.loc[[1, 2]]

1    2
2    3
dtype: int64

In [88]:
s.loc[[1, 2, 3]]

KeyError: '[3] not in index'

In [89]:
s.reindex([1, 2, 3])

1    2.0
2    3.0
3    NaN
dtype: float64

In [90]:
labels = [1, 2, 3]

s.loc[s.index.intersection(labels)]

1    2
2    3
dtype: int64

In [91]:
s.index.intersection(labels)

RangeIndex(start=1, stop=3, step=1)

In [93]:
s = pd.Series(np.arange(4), index=['a', 'a', 'b', 'c'])
s

a    0
a    1
b    2
c    3
dtype: int64

In [94]:
labels = ['c', 'd']

In [95]:
s.loc['a']

a    0
a    1
dtype: int64

# Selecting random samples

In [96]:
s = pd.Series([0, 1, 2, 3, 4, 5])
s.sample()

4    4
dtype: int64

In [97]:
s.sample(n=3)

3    3
0    0
2    2
dtype: int64

In [98]:
s.sample(frac=0.5)

5    5
2    2
4    4
dtype: int64

By default, sample will return each row at most once, but one can also sample with replacement using the replace option:

In [100]:
s = pd.Series([0, 1, 2, 3, 4, 5, 6])
s.sample(n=5, replace=True)

4    4
6    6
4    4
0    0
0    0
dtype: int64

By default, each row has an equal probability of being selected, but if you want rows to have different probabilities, you can pass the sample function sampling weights as weights. These weights can be a list, a NumPy array, or a Series, but they must be of the same length as the object you are sampling. Missing values will be treated as a weight of zero, and inf values are not allowed. If weights do not sum to 1, they will be re-normalized by dividing all weights by the sum of the weights. For example:

In [101]:
s = pd.Series([0, 1, 2, 3, 4, 5])

example_weights = [0, 0, 0.2, 0.2, 0.2, 0.4]

s.sample(n=3, weights=example_weights)

5    5
2    2
3    3
dtype: int64

In [102]:
df2 = pd.DataFrame({'col1': [9, 8, 7, 6],
                    'weight_column': [0.5, 0.4, 0.1, 0]})


df2.sample(n=3, weights='weight_column')

   col1  weight_column
1     8            0.4
0     9            0.5
2     7            0.1

In [103]:
df4 = pd.DataFrame({'col1': [1, 2, 3], 'col2': [2, 3, 4]})

In [104]:
df4.sample(n=2, random_state=2)

   col1  col2
2     3     4
1     2     3

# Setting with enlargement

In [105]:
se = pd.Series([1, 2, 3])

In [107]:
se[5]=5.

Setting with enlargement
The .loc/[] operations can perform enlargement when setting a non-existent key for that axis.

In the Series case this is effectively an appending operation.

In [108]:
dfi = pd.DataFrame(np.arange(6).reshape(3, 2),
                   columns=['A', 'B'])

In [109]:
dfi.loc[:,'C'] = dfi.loc[:,'A']

In [113]:
dfi.loc[2,'C']=2

In [114]:
dfi

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  2

In [115]:
dfi.loc[3] = 5

In [116]:
dfi

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  2
3  5  5  5

# Boolean indexing

In [117]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
                    'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
                    'c': np.random.randn(7)})

In [118]:
criterion = df2['a'].map(lambda x: x.startswith('t'))

In [119]:
criterion

0    False
1    False
2     True
3     True
4     True
5    False
6    False
Name: a, dtype: bool

In [120]:
df2[criterion]

       a  b         c
2    two  y -0.177732
3  three  x -0.410383
4    two  y  1.179716

In [122]:
# equivalent but slower
df2[[x.startswith('t') for x in df2['a']]]

       a  b         c
2    two  y -0.177732
3  three  x -0.410383
4    two  y  1.179716

# Indexing with isin()

In [123]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')

In [124]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [125]:
s.isin([2, 4, 6])

4    False
3    False
2     True
1    False
0     True
dtype: bool

In [128]:
s.isin([0, 1, 2, 5, 4, 6])

4     True
3     True
2     True
1    False
0     True
dtype: bool

In [129]:
s[s.isin([2, 4, 6])]

2    2
0    4
dtype: int64

In [134]:
s[s.index.isin([2, 4, 6])]

4    0
2    2
dtype: int64

In [135]:
s.reindex([2, 4, 6])

2    2.0
4    0.0
6    NaN
dtype: float64

In [136]:
s_mi = pd.Series(np.arange(6),
                 index=pd.MultiIndex.from_product([[0, 1], ['a', 'b', 'c']]))

In [137]:
s_mi

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int64

In [140]:
s_mi.iloc[s_mi.index.isin([(1, 'a'), (1, 'b'), (0, 'c'), (2, 'c')])]

0  c    2
1  a    3
   b    4
dtype: int64

In [141]:
s_mi.iloc[s_mi.index.isin(['a', 'c', 'e'], level=1)]

0  a    0
   c    2
1  a    3
   c    5
dtype: int64

In [142]:
df = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
                   'ids2': ['a', 'n', 'c', 'n']})


values = ['a', 'b', 1, 3]

df.isin(values)

    vals    ids   ids2
0   True   True   True
1  False   True  False
2   True  False  False
3  False  False  False

In [143]:
values = {'ids': ['a', 'b'], 'vals': [1, 3]}

df.isin(values)

    vals    ids   ids2
0   True   True  False
1  False   True  False
2   True  False  False
3  False  False  False

In [144]:
values = {'ids': ['a', 'b'], 'vals': [1, 3]}

~df.isin(values)

    vals    ids  ids2
0  False  False  True
1   True  False  True
2  False   True  True
3   True   True  True

In [149]:
values = {'ids': ['a', 'b'], 'ids2': ['a', 'c'], 'vals': [1, 3]}

row_mask = df.isin(values).all(1)

df[row_mask]

   vals ids ids2
0     1   a    a

In [146]:
df

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

# The where() Method and Masking

In [152]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [153]:
s[s>0]

3    1
2    2
1    3
0    4
dtype: int64

In [162]:
s.where(s>0)

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

In [164]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize: 'bool' = False, name: 'Hashable' = None, inclusive: 'IntervalClosedType' = 'both', *, unit: 'str | None' = None, **kwargs) -> 'DatetimeIndex'
    Return a fixed frequency DatetimeIndex.

    Returns the range of equally spaced time points (where the difference between any
    two adjacent points is specified by the given frequency) such that they all
    satisfy `start <[=] x <[=] end`, where the first one and the last one are, resp.,
    the first and last time points in that range that fall on the boundary of ``freq``
    (if given as a frequency string) or that are valid for ``freq`` (if given as a
    :class:`pandas.tseries.offsets.DateOffset`). (If exactly one of ``start``,
    ``end``, or ``freq`` is *not* specified, this missing parameter can be computed
    given ``periods``, the number of timesteps in the range. See the note below.)

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : int, optional
        Number of periods to generate.
    freq : str, datetime.timedelta, or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive unless timezone-aware datetime-likes are passed.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    inclusive : {"both", "neither", "left", "right"}, default "both"
        Include boundaries; Whether to set each bound as closed or open.

        .. versionadded:: 1.4.0
    unit : str, default None
        Specify the desired resolution of the result.

        .. versionadded:: 2.0.0
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    DatetimeIndex

    See Also
    --------
    DatetimeIndex : An immutable container for datetimes.
    timedelta_range : Return a fixed frequency TimedeltaIndex.
    period_range : Return a fixed frequency PeriodIndex.
    interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify timezone-aware `start` and `end`, with the default daily frequency.

    >>> pd.date_range(
    ...     start=pd.to_datetime("1/1/2018").tz_localize("Europe/Berlin"),
    ...     end=pd.to_datetime("1/08/2018").tz_localize("Europe/Berlin"),
    ... )
    DatetimeIndex(['2018-01-01 00:00:00+01:00', '2018-01-02 00:00:00+01:00',
                   '2018-01-03 00:00:00+01:00', '2018-01-04 00:00:00+01:00',
                   '2018-01-05 00:00:00+01:00', '2018-01-06 00:00:00+01:00',
                   '2018-01-07 00:00:00+01:00', '2018-01-08 00:00:00+01:00'],
                  dtype='datetime64[ns, Europe/Berlin]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `inclusive` controls whether to include `start` and `end` that are on the
    boundary. The default, "both", includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', inclusive="both")
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``inclusive='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', inclusive='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``inclusive='right'`` to exclude `start` if it falls on the boundary, and
    similarly ``inclusive='neither'`` will exclude both `start` and `end`.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', inclusive='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    **Specify a unit**

    >>> pd.date_range(start="2017-01-01", periods=10, freq="100AS", unit="s")
    DatetimeIndex(['2017-01-01', '2117-01-01', '2217-01-01', '2317-01-01',
                   '2417-01-01', '2517-01-01', '2617-01-01', '2717-01-01',
                   '2817-01-01', '2917-01-01'],
                  dtype='datetime64[s]', freq='100AS-JAN')

In [167]:
df = pd.DataFrame(np.random.randn(10,5),
                 index=pd.date_range('20120101', periods=10),
                 columns=list('ABCDE'))

df

                   A         B         C         D         E
2012-01-01  1.325106  0.734501 -0.954497 -0.751179 -1.130428
2012-01-02  0.769977  1.268390  0.424486  0.940536 -0.867641
2012-01-03  0.145862 -1.369871 -0.771781  0.878674 -0.239595
2012-01-04  1.209382  0.537960  2.734422  0.093765 -1.406405
2012-01-05 -0.034530 -0.963016  0.977180  0.041980 -0.137272
2012-01-06 -0.124132  0.740341 -0.452462  0.777050  1.045571
2012-01-07 -0.342142 -0.926047 -0.512965  0.710109  0.092479
2012-01-08  0.630075  1.762937  0.230954 -0.808937  1.057424
2012-01-09  0.051361  0.872447  1.066199 -0.959008  1.382005
2012-01-10  0.905122 -0.603904  0.304449  0.257207  0.023932

In [168]:
df.where(df < 0, -df)

                   A         B         C         D         E
2012-01-01 -1.325106 -0.734501 -0.954497 -0.751179 -1.130428
2012-01-02 -0.769977 -1.268390 -0.424486 -0.940536 -0.867641
2012-01-03 -0.145862 -1.369871 -0.771781 -0.878674 -0.239595
2012-01-04 -1.209382 -0.537960 -2.734422 -0.093765 -1.406405
2012-01-05 -0.034530 -0.963016 -0.977180 -0.041980 -0.137272
2012-01-06 -0.124132 -0.740341 -0.452462 -0.777050 -1.045571
2012-01-07 -0.342142 -0.926047 -0.512965 -0.710109 -0.092479
2012-01-08 -0.630075 -1.762937 -0.230954 -0.808937 -1.057424
2012-01-09 -0.051361 -0.872447 -1.066199 -0.959008 -1.382005
2012-01-10 -0.905122 -0.603904 -0.304449 -0.257207 -0.023932

In [170]:
df.where(df < 0, -df) == np.where(df < 0, df, -df)

               A     B     C     D     E
2012-01-01  True  True  True  True  True
2012-01-02  True  True  True  True  True
2012-01-03  True  True  True  True  True
2012-01-04  True  True  True  True  True
2012-01-05  True  True  True  True  True
2012-01-06  True  True  True  True  True
2012-01-07  True  True  True  True  True
2012-01-08  True  True  True  True  True
2012-01-09  True  True  True  True  True
2012-01-10  True  True  True  True  True

In [173]:
df2 = df.copy()
df

                   A         B         C         D         E
2012-01-01  1.325106  0.734501 -0.954497 -0.751179 -1.130428
2012-01-02  0.769977  1.268390  0.424486  0.940536 -0.867641
2012-01-03  0.145862 -1.369871 -0.771781  0.878674 -0.239595
2012-01-04  1.209382  0.537960  2.734422  0.093765 -1.406405
2012-01-05 -0.034530 -0.963016  0.977180  0.041980 -0.137272
2012-01-06 -0.124132  0.740341 -0.452462  0.777050  1.045571
2012-01-07 -0.342142 -0.926047 -0.512965  0.710109  0.092479
2012-01-08  0.630075  1.762937  0.230954 -0.808937  1.057424
2012-01-09  0.051361  0.872447  1.066199 -0.959008  1.382005
2012-01-10  0.905122 -0.603904  0.304449  0.257207  0.023932

In [177]:
df2.where(df2 > 0, df2['A'], axis='index')
#Command to be read as: In df2, we want df2>0 otherwise take the value of df2['A'] where df2<0

                   A         B         C         D         E
2012-01-01  1.325106  0.734501  1.325106  1.325106  1.325106
2012-01-02  0.769977  1.268390  0.424486  0.940536  0.769977
2012-01-03  0.145862  0.145862  0.145862  0.878674  0.145862
2012-01-04  1.209382  0.537960  2.734422  0.093765  1.209382
2012-01-05 -0.034530 -0.034530  0.977180  0.041980 -0.034530
2012-01-06 -0.124132  0.740341 -0.124132  0.777050  1.045571
2012-01-07 -0.342142 -0.342142 -0.342142  0.710109  0.092479
2012-01-08  0.630075  1.762937  0.230954  0.630075  1.057424
2012-01-09  0.051361  0.872447  1.066199  0.051361  1.382005
2012-01-10  0.905122  0.905122  0.304449  0.257207  0.023932

In [174]:
df2 = df.copy()

df.apply(lambda x, y: x.where(x > 0, y), y=df['A'])

                   A         B         C         D         E
2012-01-01  1.325106  0.734501  1.325106  1.325106  1.325106
2012-01-02  0.769977  1.268390  0.424486  0.940536  0.769977
2012-01-03  0.145862  0.145862  0.145862  0.878674  0.145862
2012-01-04  1.209382  0.537960  2.734422  0.093765  1.209382
2012-01-05 -0.034530 -0.034530  0.977180  0.041980 -0.034530
2012-01-06 -0.124132  0.740341 -0.124132  0.777050  1.045571
2012-01-07 -0.342142 -0.342142 -0.342142  0.710109  0.092479
2012-01-08  0.630075  1.762937  0.230954  0.630075  1.057424
2012-01-09  0.051361  0.872447  1.066199  0.051361  1.382005
2012-01-10  0.905122  0.905122  0.304449  0.257207  0.023932

In [175]:
df3 = pd.DataFrame({'A': [1, 2, 3],
                    'B': [4, 5, 6],
                    'C': [7, 8, 9]})

In [176]:
df3.where(lambda x: x > 4, lambda x: x + 10)

    A   B  C
0  11  14  7
1  12   5  8
2  13   6  9

# Mask

In [178]:
s.mask(s >= 0)

4   NaN
3   NaN
2   NaN
1   NaN
0   NaN
dtype: float64

In [179]:
df.mask(df>0)

                   A         B         C         D         E
2012-01-01       NaN       NaN -0.954497 -0.751179 -1.130428
2012-01-02       NaN       NaN       NaN       NaN -0.867641
2012-01-03       NaN -1.369871 -0.771781       NaN -0.239595
2012-01-04       NaN       NaN       NaN       NaN -1.406405
2012-01-05 -0.034530 -0.963016       NaN       NaN -0.137272
2012-01-06 -0.124132       NaN -0.452462       NaN       NaN
2012-01-07 -0.342142 -0.926047 -0.512965       NaN       NaN
2012-01-08       NaN       NaN       NaN -0.808937       NaN
2012-01-09       NaN       NaN       NaN -0.959008       NaN
2012-01-10       NaN -0.603904       NaN       NaN       NaN

# Setting with enlargement conditionally using numpy()

In [180]:
df = pd.DataFrame({'col1': list('ABBC'), 'col2': list('ZZXY')})

df['color'] = np.where(df['col2'] == 'Z', 'green', 'red')

df

  col1 col2  color
0    A    Z  green
1    B    Z  green
2    B    X    red
3    C    Y    red

In [181]:
conditions = [
    (df['col2'] == 'Z') & (df['col1'] == 'A'),
    (df['col2'] == 'Z') & (df['col1'] == 'B'),
    (df['col1'] == 'B')
]

In [182]:
choices = ['yellow', 'blue', 'purple']

In [183]:
df['color'] = np.select(conditions, choices, default='black')

In [184]:
df

  col1 col2   color
0    A    Z  yellow
1    B    Z    blue
2    B    X  purple
3    C    Y   black

In [185]:
conditions

[0     True
 1    False
 2    False
 3    False
 dtype: bool,
 0    False
 1     True
 2    False
 3    False
 dtype: bool,
 0    False
 1     True
 2     True
 3    False
 Name: col1, dtype: bool]

In [186]:
n = 10

df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

df

          a         b         c
0  0.501516  0.798295  0.649964
1  0.701967  0.795793  0.890005
2  0.337995  0.375583  0.093982
3  0.578280  0.035942  0.465598
4  0.542645  0.286541  0.590833
5  0.030500  0.037348  0.822601
6  0.360191  0.127061  0.522243
7  0.769994  0.215821  0.622890
8  0.085347  0.051682  0.531355
9  0.540635  0.637430  0.726091

# The query() Method

In [187]:
n = 10

df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

df

          a         b         c
0  0.975852  0.516300  0.322956
1  0.795186  0.270832  0.438971
2  0.078456  0.025351  0.962648
3  0.835980  0.695974  0.408953
4  0.173294  0.156437  0.250243
5  0.549227  0.714596  0.660197
6  0.279934  0.954865  0.737897
7  0.554354  0.611721  0.419600
8  0.247731  0.355973  0.757846
9  0.014393  0.116073  0.046003

In [189]:
df[(df['a']<df['b']) & (df['b']<df['c'])]

          a         b         c
8  0.247731  0.355973  0.757846

In [190]:
df.query('(a < b) & (b < c)')

          a         b         c
8  0.247731  0.355973  0.757846

## MultiIndex query() Syntax

In [191]:
n = 10

colors = np.random.choice(['red', 'green'], size=n)

foods = np.random.choice(['eggs', 'ham'], size=n)

In [192]:
colors

array(['red', 'green', 'green', 'green', 'green', 'red', 'green', 'green',
       'green', 'green'], dtype='<U5')

In [193]:
index = pd.MultiIndex.from_arrays([colors, foods], names=['color', 'food'])
index

MultiIndex([(  'red',  'ham'),
            ('green', 'eggs'),
            ('green', 'eggs'),
            ('green',  'ham'),
            ('green', 'eggs'),
            (  'red',  'ham'),
            ('green',  'ham'),
            ('green', 'eggs'),
            ('green', 'eggs'),
            ('green',  'ham')],
           names=['color', 'food'])

In [194]:
df = pd.DataFrame(np.random.randn(n, 2), index=index)

In [195]:
df

                   0         1
color food
red   ham   0.871914  1.543068
green eggs  1.323264 -0.128412
      eggs -0.465665  0.058509
      ham   2.347997  0.404976
      eggs  0.909738 -0.202458
red   ham   0.060897  0.647163
green ham   0.126095 -1.897377
      eggs  1.280541 -0.615134
      eggs  2.111318  0.686849
      ham   0.070972  0.439327

In [196]:
df.query('color == "red"')

                   0         1
color food
red   ham   0.871914  1.543068
      ham   0.060897  0.647163

In [198]:
df.query('color == "green" & food=="eggs"')

                   0         1
color food
green eggs  1.323264 -0.128412
      eggs -0.465665  0.058509
      eggs  0.909738 -0.202458
      eggs  1.280541 -0.615134
      eggs  2.111318  0.686849

In [199]:
df.index.names = [None, None]

In [200]:
df.query('ilevel_0 == "red"')

                0         1
red ham  0.871914  1.543068
    ham  0.060897  0.647163

## query() Use Cases

A use case for query() is when you have a collection of DataFrame objects that have a subset of column names (or index levels/names) in common. You can pass the same query to both frames without having to specify which frame you’re interested in querying

In [201]:
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

df

          a         b         c
0  0.905351  0.195791  0.069361
1  0.100778  0.018222  0.094443
2  0.683007  0.071189  0.318976
3  0.844875  0.023272  0.814468
4  0.281855  0.118165  0.696737
5  0.628943  0.877472  0.735071
6  0.803481  0.282035  0.177440
7  0.750615  0.806835  0.990505
8  0.412618  0.372018  0.776413
9  0.340804  0.930757  0.858413

In [202]:
df2 = pd.DataFrame(np.random.rand(n + 2, 3), columns=df.columns)

df2

           a         b         c
0   0.428994  0.750871  0.754543
1   0.103124  0.902553  0.505252
2   0.826457  0.320050  0.895523
3   0.389202  0.010838  0.905382
4   0.091287  0.319314  0.950062
5   0.950607  0.573438  0.631837
6   0.448446  0.293211  0.328665
7   0.672518  0.752375  0.791579
8   0.789618  0.091206  0.494420
9   0.057559  0.549529  0.441531
10  0.887704  0.350915  0.117067
11  0.142992  0.761511  0.618218

In [203]:
expr = '0.0 <= a <= c <= 0.5'

In [204]:
map(lambda frame: frame.query(expr), [df, df2])

In [205]:
help(map)

Help on class map in module builtins:

class map(object)
 |  map(func, *iterables) --> map object
 |
 |  Make an iterator that computes the function using arguments from
 |  each of the iterables.  Stops when the shortest iterable is exhausted.
 |
 |  Methods defined here:
 |
 |  __getattribute__(self, name, /)
 |      Return getattr(self, name).
 |
 |  __iter__(self, /)
 |      Implement iter(self).
 |
 |  __next__(self, /)
 |      Implement next(self).
 |
 |  __reduce__(...)
 |      Return state information for pickling.
 |
 |  ----------------------------------------------------------------------
 |  Static methods defined here:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.

## The in and not in operator

In [206]:
df = pd.DataFrame({'a': list('aabbccddeeff'), 'b': list('aaaabbbbcccc'),
                   'c': np.random.randint(5, size=12),
                   'd': np.random.randint(9, size=12)})

In [207]:
df

    a  b  c  d
0   a  a  4  7
1   a  a  4  0
2   b  a  1  5
3   b  a  0  3
4   c  b  1  0
5   c  b  2  6
6   d  b  1  8
7   d  b  1  3
8   e  c  4  3
9   e  c  4  5
10  f  c  4  2
11  f  c  2  5

In [208]:
df.query('a in b')

   a  b  c  d
0  a  a  4  7
1  a  a  4  0
2  b  a  1  5
3  b  a  0  3
4  c  b  1  0
5  c  b  2  6

In [209]:
df[df['a'].isin(df['b'])]

   a  b  c  d
0  a  a  4  7
1  a  a  4  0
2  b  a  1  5
3  b  a  0  3
4  c  b  1  0
5  c  b  2  6

In [210]:
df.query('a not in b')

    a  b  c  d
6   d  b  1  8
7   d  b  1  3
8   e  c  4  3
9   e  c  4  5
10  f  c  4  2
11  f  c  2  5

In [211]:
df.query('a in b and c < d')

   a  b  c  d
0  a  a  4  7
2  b  a  1  5
3  b  a  0  3
5  c  b  2  6

## Special use of the == operator with list objects

In [212]:
df

    a  b  c  d
0   a  a  4  7
1   a  a  4  0
2   b  a  1  5
3   b  a  0  3
4   c  b  1  0
5   c  b  2  6
6   d  b  1  8
7   d  b  1  3
8   e  c  4  3
9   e  c  4  5
10  f  c  4  2
11  f  c  2  5

In [213]:
df.query('b == ["a", "b", "c"]')

    a  b  c  d
0   a  a  4  7
1   a  a  4  0
2   b  a  1  5
3   b  a  0  3
4   c  b  1  0
5   c  b  2  6
6   d  b  1  8
7   d  b  1  3
8   e  c  4  3
9   e  c  4  5
10  f  c  4  2
11  f  c  2  5

In [214]:
df.query('b == ["a", "c"]')

    a  b  c  d
0   a  a  4  7
1   a  a  4  0
2   b  a  1  5
3   b  a  0  3
8   e  c  4  3
9   e  c  4  5
10  f  c  4  2
11  f  c  2  5

In [215]:
df.query('[1, 2] in c')

    a  b  c  d
2   b  a  1  5
4   c  b  1  0
5   c  b  2  6
6   d  b  1  8
7   d  b  1  3
11  f  c  2  5

In [216]:
# short query syntax
shorter = df.query('a < b < c and (not bools) or bools > 2')

# equivalent in pure Python
longer = df[(df['a'] < df['b'])
            & (df['b'] < df['c'])
            & (~df['bools'])
            | (df['bools'] > 2)]

TypeError: '<' not supported between instances of 'str' and 'int'

# duplicate

In [217]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'two', 'two', 'three', 'four'],
                    'b': ['x', 'y', 'x', 'y', 'x', 'x', 'x'],
                    'c': np.random.randn(7)})

In [218]:
df2.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [219]:
df2.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [220]:
df2.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [221]:
df2.drop_duplicates('a')

       a  b         c
0    one  x -0.108498
2    two  x  0.831958
5  three  x -0.574201
6   four  x -1.491974

In [222]:
df2.drop_duplicates('a', keep='last')

       a  b         c
1    one  y -1.019341
4    two  x -1.875779
5  three  x -0.574201
6   four  x -1.491974

In [223]:
df2.drop_duplicates('a', keep=False)

       a  b         c
5  three  x -0.574201
6   four  x -1.491974

In [224]:
df2.duplicated(['a', 'b'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [225]:
df2.drop_duplicates(['a', 'b'])

       a  b         c
0    one  x -0.108498
1    one  y -1.019341
2    two  x  0.831958
3    two  y -0.724334
5  three  x -0.574201
6   four  x -1.491974

In [229]:
df3 = pd.DataFrame({'a': np.arange(6),
                    'b': np.random.randn(6)},
                   index=['a', 'a', 'b', 'c', 'b', 'a'])
df3

   a         b
a  0 -0.539745
a  1 -1.419962
b  2 -0.846934
c  3 -0.045250
b  4 -2.564342
a  5  1.142726

In [230]:
df3.index.duplicated()

array([False,  True, False, False,  True,  True])

In [231]:
df3[~df3.index.duplicated()]

   a         b
a  0 -0.539745
b  2 -0.846934
c  3 -0.045250

# Dictionary-like get()

In [232]:
s = pd.Series([1, 2, 3], index=['a', 'b', 'c'])

s.get('a')

1

# Looking up values by index/column labels

In [234]:
df = pd.DataFrame({'col': ["A", "A", "B", "B"],
                   'A': [80, 23, np.nan, 22],
                   'B': [80, 55, 76, 67]})

In [236]:
idx, cols = pd.factorize(df['col'])
idx

array([0, 0, 1, 1])

In [237]:
cols

Index(['A', 'B'], dtype='object')

In [238]:
help(pd.factorize)

Help on function factorize in module pandas.core.algorithms:

factorize(values, sort: 'bool' = False, use_na_sentinel: 'bool' = True, size_hint: 'int | None' = None) -> 'tuple[np.ndarray, np.ndarray | Index]'
    Encode the object as an enumerated type or categorical variable.

    This method is useful for obtaining a numeric representation of an
    array when all that matters is identifying distinct values. `factorize`
    is available as both a top-level function :func:`pandas.factorize`,
    and as a method :meth:`Series.factorize` and :meth:`Index.factorize`.

    Parameters
    ----------
    values : sequence
        A 1-D sequence. Sequences that aren't pandas objects are
        coerced to ndarrays before factorization.
    sort : bool, default False
        Sort `uniques` and shuffle `codes` to maintain the
        relationship.

    use_na_sentinel : bool, default True
        If True, the sentinel -1 will be used for NaN values. If False,
        NaN values will be encoded as non-negative integers and will not drop the
        NaN from the uniques of the values.

        .. versionadded:: 1.5.0
    size_hint : int, optional
        Hint to the hashtable sizer.

    Returns
    -------
    codes : ndarray
        An integer ndarray that's an indexer into `uniques`.
        ``uniques.take(codes)`` will have the same values as `values`.
    uniques : ndarray, Index, or Categorical
        The unique valid values. When `values` is Categorical, `uniques`
        is a Categorical. When `values` is some other pandas object, an
        `Index` is returned. Otherwise, a 1-D ndarray is returned.

        .. note::

           Even if there's a missing value in `values`, `uniques` will
           *not* contain an entry for it.

    See Also
    --------
    cut : Discretize continuous-valued array.
    unique : Find the unique value in an array.

    Notes
    -----
    Reference :ref:`the user guide <reshaping.factorize>` for more examples.

    Examples
    --------
    These examples all show factorize as a top-level method like
    ``pd.factorize(values)``. The results are identical for methods like
    :meth:`Series.factorize`.

    >>> codes, uniques = pd.factorize(['b', 'b', 'a', 'c', 'b'])
    >>> codes
    array([0, 0, 1, 2, 0])
    >>> uniques
    array(['b', 'a', 'c'], dtype=object)

    With ``sort=True``, the `uniques` will be sorted, and `codes` will be
    shuffled so that the relationship is the maintained.

    >>> codes, uniques = pd.factorize(['b', 'b', 'a', 'c', 'b'], sort=True)
    >>> codes
    array([1, 1, 0, 2, 1])
    >>> uniques
    array(['a', 'b', 'c'], dtype=object)

    When ``use_na_sentinel=True`` (the default), missing values are indicated in
    the `codes` with the sentinel value ``-1`` and missing values are not
    included in `uniques`.

    >>> codes, uniques = pd.factorize(['b', None, 'a', 'c', 'b'])
    >>> codes
    array([ 0, -1,  1,  2,  0])
    >>> uniques
    array(['b', 'a', 'c'], dtype=object)

    Thus far, we've only factorized lists (which are internally coerced to
    NumPy arrays). When factorizing pandas objects, the type of `uniques`
    will differ. For Categoricals, a `Categorical` is returned.

    >>> cat = pd.Categorical(['a', 'a', 'c'], categories=['a', 'b', 'c'])
    >>> codes, uniques = pd.factorize(cat)
    >>> codes
    array([0, 0, 1])
    >>> uniques
    ['a', 'c']
    Categories (3, object): ['a', 'b', 'c']

    Notice that ``'b'`` is in ``uniques.categories``, despite not being
    present in ``cat.values``.

    For all other pandas objects, an Index of the appropriate type is
    returned.

    >>> cat = pd.Series(['a', 'a', 'c'])
    >>> codes, uniques = pd.factorize(cat)
    >>> codes
    array([0, 0, 1])
    >>> uniques
    Index(['a', 'c'], dtype='object')

    If NaN is in the values, and we want to include NaN in the uniques of the
    values, it can be achieved by setting ``use_na_sentinel=False``.

    >>> values = np.array([1, 2, 1, np.nan])
    >>> codes, uniques = pd.factorize(values)  # default: use_na_sentinel=True
    >>> codes
    array([ 0,  1,  0, -1])
    >>> uniques
    array([1., 2.])

    >>> codes, uniques = pd.factorize(values, use_na_sentinel=False)
    >>> codes
    array([0, 1, 0, 2])
    >>> uniques
    array([ 1.,  2., nan])

In [239]:
df.reindex(cols, axis=1).to_numpy()[np.arange(len(df)), idx]

array([80., 23., 76., 67.])

# Index objects

In [240]:
index = pd.Index(['e', 'd', 'a', 'b'])

index

'd' in index

True

## Setting metadata

In [241]:
ind = pd.Index([1, 2, 3])

ind.rename("apple")

Index([1, 2, 3], dtype='int64', name='apple')

In [242]:
index = pd.MultiIndex.from_product([range(3), ['one', 'two']], names=['first', 'second'])

index

MultiIndex([(0, 'one'),
            (0, 'two'),
            (1, 'one'),
            (1, 'two'),
            (2, 'one'),
            (2, 'two')],
           names=['first', 'second'])

In [243]:
index.levels[1]

Index(['one', 'two'], dtype='object', name='second')

In [244]:
index.set_levels(["a", "b"], level=1)

MultiIndex([(0, 'a'),
            (0, 'b'),
            (1, 'a'),
            (1, 'b'),
            (2, 'a'),
            (2, 'b')],
           names=['first', 'second'])

In [245]:
a = pd.Index(['c', 'b', 'a'])

b = pd.Index(['c', 'e', 'd'])

In [246]:
a.difference(b)

Index(['a', 'b'], dtype='object')

In [247]:
idx1 = pd.Index([1, 2, 3, 4])

idx2 = pd.Index([2, 3, 4, 5])

idx1.symmetric_difference(idx2)

Index([1, 5], dtype='int64')

# Set / reset index

## Set an index

In [249]:
df.set_index('B')

   col     A
B
80   A  80.0
55   A  23.0
76   B   NaN
67   B  22.0

In [253]:
frame = df.set_index('B', drop=False)

frame = frame.set_index(['col', 'A'], append=True)

frame

              B
B  col A
80 A   80.0  80
55 A   23.0  55
76 B   NaN   76
67 B   22.0  67

In [252]:
df

  col     A   B
0   A  80.0  80
1   A  23.0  55
2   B   NaN  76
3   B  22.0  67

In [254]:
df.set_index('B', drop=False)

   col     A   B
B
80   A  80.0  80
55   A  23.0  55
76   B   NaN  76
67   B  22.0  67